{
  "backend/main.mo": "Motoko actor storing submitted contact messages in a map, providing methods to submit messages and query all messages or their count.",
  "feature_evidence.json": "Feature evidence report listing implemented UI/UX enhancements, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file mapping frontend file paths to short human-written descriptions of their purpose and styling updates.",
  "frontend/DEPLOYMENT_FAILURE_REPORT.md": "Template for recording deployment failures, including timestamps, failing step, and full error output.",
  "frontend/DEPLOYMENT_OUTPUT.md": "Document for capturing latest deployment status, timestamp, commit hash, and executed commands.",
  "frontend/DEPLOYMENT_RETRY.md": "Runbook describing how to retry deployment without modifying code, including prerequisites and steps.",
  "frontend/index.css": "Global Tailwind CSS layer defining professional theme variables, typography rules, accessibility focus states, and reusable component styles.",
  "frontend/index.html": "HTML entry point with SEO metadata, favicon links, and script loader for the React application.",
  "frontend/public/googled81497cd2eafdaf4.html": "Google site verification file for domain ownership validation.",
  "frontend/public/robots.txt": "Robots configuration allowing all crawlers and pointing to the sitemap.",
  "frontend/public/site.webmanifest": "Web app manifest defining app name, icons, colors, and standalone display mode.",
  "frontend/public/sitemap.xml": "Static sitemap declaring the root URL with monthly change frequency.",
  "frontend/src/App.tsx": "Main React app wiring header, footer, all site sections, SEO data injection, and error boundary.",
  "frontend/src/components/AppErrorBoundary.tsx": "Error boundary component that displays a fallback UI and reload option if runtime errors occur.",
  "frontend/src/components/ContactForm.tsx": "Implements a contact form with validation, mutation submission, error handling, and a success state UI.",
  "frontend/src/components/MobileNav.tsx": "Renders a mobile navigation menu with active-state styling and click-to-scroll behavior.",
  "frontend/src/components/SectionHeader.tsx": "Displays a section title and optional subtitle with configurable alignment.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders the About section with text content, feature cards, and optional leadership profiles.",
  "frontend/src/components/sections/ContactSection.tsx": "Displays contact information and renders the ContactForm alongside structured contact details.",
  "frontend/src/components/sections/HomeSection.tsx": "Hero section with ocean background, tagline, title, subtitle, and buttons that smooth-scroll to other sections.",
  "frontend/src/components/sections/ProjectsSection.tsx": "Displays project cards using siteContent data with images, descriptions, and impact metrics.",
  "frontend/src/components/sections/ServicesSection.tsx": "Renders a grid of service cards with icons mapped from siteContent and a section header.",
  "frontend/src/components/sections/TestimonialsSection.tsx": "Shows testimonial cards with quotes, names, and roles sourced from siteContent.",
  "frontend/src/components/sections/WhyChooseUsSection.tsx": "Presents key value propositions in a grid with icons and text from siteContent.",
  "frontend/src/components/SeoStructuredData.tsx": "Injects organization-level JSON-LD structured data for SEO using site content and brand assets.",
  "frontend/src/components/SiteFooter.tsx": "Builds a footer with company info, quick links, contact details, and logo download support.",
  "frontend/src/components/SiteHeader.tsx": "Creates a responsive site header with logo, desktop navigation, and toggleable mobile menu.",
  "frontend/src/content/siteContent.ts": "Static content definitions for company info, hero text, services, projects, about, and testimonials.",
  "frontend/src/hooks/useActiveSection.ts": "Hook using IntersectionObserver to track and return the currently visible page section.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous backend actors and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, authentication handling, and identity loading via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines mutation hook for submitting messages through the backend actor and invalidating related queries.",
  "frontend/src/hooks/useRuntimeSeo.ts": "Updates canonical and social meta tags at runtime based on the actual site URL.",
  "frontend/src/index.css": "Re-exports global styles by importing the root index.css file.",
  "frontend/src/lib/brandAssets.ts": "Exports constant paths for all brand logo and social image assets.",
  "frontend/src/lib/isValidEmail.ts": "Provides a simple email validation function using a basic regex.",
  "frontend/src/lib/siteOrigin.ts": "Utilities to get the current site origin and build full URLs safely.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme tokens, colors, spacing, and plugins.",
  "project_state.json": "Metadata describing project state, features, and pending theme upgrade request."
}