{
  "backend/main.mo": "Empty Motoko actor defining a no-op backend canister.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and styling of various frontend files and components.",
  "frontend/DEPLOYMENT_FAILURE_REPORT.md": "Template for recording deployment failure details and error output.",
  "frontend/DEPLOYMENT_OUTPUT.md": "Template file for documenting the latest deployment status, timestamp, and commands used.",
  "frontend/DEPLOYMENT_RETRY.md": "Runbook outlining steps to retry deployment using the current repository state.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining color variables, typography, layout rules, and component utilities.",
  "frontend/index.html": "HTML entry point containing SEO metadata, favicon links, and OG/Twitter images referencing the updated logo.",
  "frontend/public/googled81497cd2eafdaf4.html": "Google site verification file for domain ownership validation.",
  "frontend/public/robots.txt": "Robots configuration allowing full crawl access and linking to the sitemap.",
  "frontend/public/site.webmanifest": "PWA manifest defining app name, icons, theme colors, and display mode.",
  "frontend/public/sitemap.xml": "XML sitemap listing the root URL with metadata for search engines.",
  "frontend/src/App.tsx": "Main app layout combining header, sections, footer, SEO data, and an error boundary.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary ensuring the site stays accessible and provides a fallback UI on failures.",
  "frontend/src/components/ContactForm.tsx": "Contact form with validation, submission success state, and controlled inputs.",
  "frontend/src/components/MobileNav.tsx": "Mobile navigation panel displaying vertical links with active-state styling and navigation handling.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders the About section with text content, stats cards, and optional partner listings.",
  "frontend/src/components/sections/ContactSection.tsx": "Shows contact information with validation and a contact form.",
  "frontend/src/components/sections/HomeSection.tsx": "Displays hero section with title, subtitle, and CTA buttons that scroll to sections.",
  "frontend/src/components/sections/ServicesSection.tsx": "Lists services using mapped icons and card components based on site content.",
  "frontend/src/components/SeoStructuredData.tsx": "Renders organization schema JSON-LD using site content and brand assets.",
  "frontend/src/components/SiteFooter.tsx": "Displays footer with company info, navigation links, and validated contact details.",
  "frontend/src/components/SiteHeader.tsx": "Provides sticky header with logo, navigation links, and mobile menu toggle with smooth scrolling.",
  "frontend/src/content/siteContent.ts": "Defines structured site content including company info, home hero text, about details, services list, and contact data.",
  "frontend/src/hooks/useActiveSection.ts": "Implements an IntersectionObserver hook to track and return the currently visible page section.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor using React Query, updating when the Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication and login state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for future backend-related React Query hooks.",
  "frontend/src/hooks/useRuntimeSeo.ts": "Updates canonical and social meta tags at runtime using the current site URL.",
  "frontend/src/index.css": "Imports the root stylesheet for the frontend.",
  "frontend/src/lib/brandAssets.ts": "Exports constants defining paths to brand logo and social image assets.",
  "frontend/src/lib/isValidEmail.ts": "Exports a basic email validation function using a simple regex check.",
  "frontend/src/lib/siteOrigin.ts": "Provides helpers to get the current site origin and build full URLs safely.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, plugins, colors, fonts, and responsive container settings.",
  "project_state.json": "Stores project metadata including logo redesign requirements, features, and asset update instructions."
}