{
  "backend/main.mo": "Motoko actor storing user messages in a Map with submit, list, and count operations.",
  "feature_evidence.json": "JSON report describing implemented features, associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-like text listing concise summaries of many frontend files.",
  "frontend/DEPLOYMENT_FAILURE_REPORT.md": "Template for documenting deployment failures and related diagnostic details.",
  "frontend/DEPLOYMENT_OUTPUT.md": "Template describing latest deployment status, timestamp, and commands executed.",
  "frontend/DEPLOYMENT_RETRY.md": "Runbook explaining how to retry deployment without making code changes.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining color palette, typography, and layout utilities.",
  "frontend/index.html": "Base HTML document including SEO meta tags, icons, and root mount point for the app.",
  "frontend/public/googled81497cd2eafdaf4.html": "Google site verification file.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers and referencing sitemap.",
  "frontend/public/site.webmanifest": "Web app manifest defining icons, colors, and PWA display settings.",
  "frontend/public/sitemap.xml": "Sitemap XML listing the main site URL and metadata.",
  "frontend/src/App.tsx": "Main React app composition with sections, SEO, preloader, and error boundary wrapped in a QueryClientProvider.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that shows a fallback UI and logs caught errors.",
  "frontend/src/components/BrandAssetPreloader.tsx": "Component that preloads brand logo assets and logs load success or failure.",
  "frontend/src/components/ContactForm.tsx": "Implements a contact form with validation, mutation-based submission, and success/error UI states.",
  "frontend/src/components/MobileNav.tsx": "Renders a mobile navigation menu that highlights the active section and triggers smooth scrolling.",
  "frontend/src/components/SectionHeader.tsx": "Displays a section header with optional subtitle and configurable alignment.",
  "frontend/src/components/sections/AboutSection.tsx": "Builds the About section with text content, imagery, core values, and leadership profiles.",
  "frontend/src/components/sections/ContactSection.tsx": "Provides the Contact section with contact details, supporting imagery, and the contact form.",
  "frontend/src/components/sections/HomeSection.tsx": "Hero section with background video/image, motion preference handling, and CTA buttons scrolling to other sections.",
  "frontend/src/components/sections/ProjectsSection.tsx": "Renders a projects grid with icons, descriptions, and impact details using siteContent data.",
  "frontend/src/components/sections/ServicesSection.tsx": "Displays service cards with mapped icons, titles, and descriptions sourced from siteContent.",
  "frontend/src/components/sections/TestimonialsSection.tsx": "Shows testimonial cards with quotes, names, and roles pulled from siteContent.",
  "frontend/src/components/sections/WhyChooseUsSection.tsx": "Presents a grid of reasons to choose the company, each with an icon, title, and description.",
  "frontend/src/components/SeoStructuredData.tsx": "Injects organization schema data into the page for SEO in JSON-LD format.",
  "frontend/src/components/SiteFooter.tsx": "Provides footer layout with company info, quick links, contact details, and logo download support.",
  "frontend/src/components/SiteHeader.tsx": "Creates a sticky site header with desktop and mobile navigation and smooth scrolling to sections.",
  "frontend/src/content/siteContent.ts": "Centralized content configuration object containing text and structure for all site sections.",
  "frontend/src/hooks/useActiveSection.ts": "Tracks and returns the currently visible page section using IntersectionObserver.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on authentication state, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects user reduced‑motion preference via media query and updates on changes.",
  "frontend/src/hooks/useQueries.ts": "Defines a mutation hook for submitting messages through the backend actor and invalidating related queries.",
  "frontend/src/hooks/useRuntimeSeo.ts": "React hook that updates canonical and social meta tags to match the current site origin at runtime.",
  "frontend/src/index.css": "Imports the root CSS file for the frontend bundle.",
  "frontend/src/lib/brandAssets.ts": "Exports constants defining paths to all logo and brand asset images.",
  "frontend/src/lib/isValidEmail.ts": "Provides a simple email validation function using a basic regex.",
  "frontend/src/lib/siteOrigin.ts": "Utilities to get the current site origin and build full URLs from paths.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme settings, plugins, and design tokens.",
  "project_state.json": "Describes project state, logo redesign requirements, and related frontend update tasks."
}