{
  "backend/main.mo": "Motoko canister handling user profiles and construction inquiries with access‑controlled admin/user operations and persistent state.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and requirements with confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend files including components, styles, and configuration.",
  "frontend/DEPLOYMENT_FAILURE_REPORT.md": "Template for documenting deployment failures, error details, and debugging information.",
  "frontend/DEPLOYMENT_OUTPUT.md": "Template for recording latest deployment status, timestamp, commit hash, and executed commands.",
  "frontend/DEPLOYMENT_RETRY.md": "Runbook outlining steps for retrying deployment without modifying code.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining construction-themed OKLCH color palette, typography, utilities, and layout helpers.",
  "frontend/index.html": "HTML entry with full SEO metadata, favicons, branding, and scripts for the BuildCraft Construction site.",
  "frontend/public/googlea9cbad697de95c99.html": "Google Search Console HTML verification file.",
  "frontend/public/googled81497cd2eafdaf4.html": "Google Search Console HTML verification file.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers and referencing sitemap.xml.",
  "frontend/public/site.webmanifest": "PWA manifest defining BuildCraft name, icons, theme color, and display settings.",
  "frontend/public/sitemap.xml": "Sitemap listing the root URL with last modified date and crawl preferences.",
  "frontend/src/App.tsx": "Main React application wiring sections, routing via hash, SEO setup, Internet Identity provider, and global query client.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches app failures and displays a fallback refresh screen.",
  "frontend/src/components/BrandAssetPreloader.tsx": "Preloads brand logo images on mount and logs load success or failures.",
  "frontend/src/components/ContactForm.tsx": "Contact form with validation, inquiry submission, and success state handling.",
  "frontend/src/components/CountriesBar.tsx": "Empty component file with no implementation provided.",
  "frontend/src/components/MobileNav.tsx": "Mobile navigation menu that lists links and triggers scroll navigation when open.",
  "frontend/src/components/screens/SignInScreen.tsx": "Sign‑in screen using Internet Identity with login, logout, and error display states.",
  "frontend/src/components/SectionHeader.tsx": "Reusable section header with configurable title, subtitle, and alignment.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders the About section with text, team imagery, core values, and partner profiles using siteContent.",
  "frontend/src/components/sections/ContactSection.tsx": "Displays contact info, a supporting image, and a contact form sourced from siteContent.",
  "frontend/src/components/sections/HomeSection.tsx": "Builds the hero section with background image, tagline, title, subtitle, and CTA buttons that scroll to other sections.",
  "frontend/src/components/sections/ProjectsSection.tsx": "Shows a grid of project cards with icons and descriptions pulled from siteContent.",
  "frontend/src/components/sections/ServicesSection.tsx": "Renders service cards with rotating icons and descriptions from siteContent.",
  "frontend/src/components/sections/TestimonialsSection.tsx": "Displays testimonial cards with quotes, names, and roles based on siteContent.",
  "frontend/src/components/sections/WhyChooseUsSection.tsx": "Shows feature cards explaining value propositions with icons and text from siteContent.",
  "frontend/src/components/SeoStructuredData.tsx": "Injects organization schema structured data into the document head on mount.",
  "frontend/src/components/SiteFooter.tsx": "Footer displaying company info, quick links, and contact details with scroll helpers.",
  "frontend/src/components/SiteHeader.tsx": "Sticky site header with logo, desktop nav, and mobile menu controlling section scrolling.",
  "frontend/src/content/siteContent.ts": "Provides all static site content including company info and data for all sections.",
  "frontend/src/hooks/useActiveSection.ts": "Custom hook tracking the currently visible page section using IntersectionObserver.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing related queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and logout.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects the user's reduced‑motion preference via a media query and updates on change.",
  "frontend/src/hooks/useQueries.ts": "Defines a mutation to submit inquiries through the backend actor and invalidates related queries on success.",
  "frontend/src/hooks/useRuntimeSeo.ts": "Updates canonical and social meta URL tags at runtime based on the current deployed origin.",
  "frontend/src/index.css": "Re-exports the project's root CSS file.",
  "frontend/src/lib/brandAssets.ts": "Centralizes static paths for brand logos and social images.",
  "frontend/src/lib/countries.ts": "Empty module placeholder for country data.",
  "frontend/src/lib/isValidEmail.ts": "Exports a simple regex-based email format validator.",
  "frontend/src/lib/siteOrigin.ts": "Provides helpers to get the site origin and build full URLs for paths.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity providers.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration specifying content paths, theme customizations, and plugins.",
  "project_state.json": "Defines the project’s state, feature requirements, and asset needs for aligning the site with buildcraft.co.in."
}