{
  "backend/main.mo": "Defines an empty Motoko actor canister.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Aggregated short summaries for all frontend source files and assets.",
  "frontend/DEPLOYMENT_FAILURE_REPORT.md": "Template for recording deployment failure details and error output.",
  "frontend/DEPLOYMENT_OUTPUT.md": "Template document for tracking latest deployment status and metadata.",
  "frontend/DEPLOYMENT_RETRY.md": "Runbook describing how to retry deployment without code changes.",
  "frontend/index.css": "Global Tailwind-based theme and component styling including nav links, sections, and cards.",
  "frontend/index.html": "Main HTML entry point with SEO tags, favicons, and root mounting element.",
  "frontend/public/googled81497cd2eafdaf4.html": "Google site verification token file.",
  "frontend/public/robots.txt": "Allows all crawlers and provides sitemap location.",
  "frontend/public/site.webmanifest": "Web manifest defining app name, icons, colors, and display mode.",
  "frontend/public/sitemap.xml": "Sitemap declaring the site's root URL and metadata.",
  "frontend/src/App.tsx": "Renders full site layout with header, sections, footer, SEO, and error boundary.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that shows a fallback screen on runtime errors.",
  "frontend/src/components/ContactForm.tsx": "Contact form component with validation, success state, and styled inputs.",
  "frontend/src/components/MobileNav.tsx": "Renders a mobile navigation menu with links, highlighting the active section and handling smooth navigation.",
  "frontend/src/components/sections/AboutSection.tsx": "Shows the About section with title, content paragraphs, statistics, and optional partners list.",
  "frontend/src/components/sections/ContactSection.tsx": "Renders the Contact section including contact details and a contact form with email validation.",
  "frontend/src/components/sections/HomeSection.tsx": "Implements the hero section with background visuals, company tagline, main heading, and CTA buttons that scroll to sections.",
  "frontend/src/components/sections/ServicesSection.tsx": "Displays a grid of service cards with icons, titles, and descriptions sourced from site content.",
  "frontend/src/components/SeoStructuredData.tsx": "Injects JSON-LD organization metadata into the page for SEO using site content and generated URLs.",
  "frontend/src/components/SiteFooter.tsx": "Displays company info, quick links, and contact details with smooth-scroll navigation and email validation.",
  "frontend/src/components/SiteHeader.tsx": "Provides a responsive header with logo, desktop and mobile navigation, and smooth scrolling to sections.",
  "frontend/src/content/siteContent.ts": "Provides static text and structured content for company info, home, about, services, and contact sections.",
  "frontend/src/hooks/useActiveSection.ts": "Tracks which page section is currently visible using IntersectionObserver.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and invalidates queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, managing login, stored identities, and status.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for future backend React Query hooks.",
  "frontend/src/hooks/useRuntimeSeo.ts": "Dynamically updates canonical and social meta tags based on the current site URL.",
  "frontend/src/index.css": "Re-exports the root index.css for styling.",
  "frontend/src/lib/isValidEmail.ts": "Contains a simple email validation utility using a basic regex.",
  "frontend/src/lib/siteOrigin.ts": "Provides helpers to get the current site origin and construct full URLs.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, plugins, colors, spacing, and animations.",
  "project_state.json": "Describes project state, requirements, and pending feature requests for layout and navigation updates."
}