{
  "kind": "build_request",
  "title": "Refresh brand logo to a bold, youthful, forward-thinking typographic style",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a new typographic logo design for “Ocean Empowerer Solutions” that uses a bold, unique font style and a color treatment that feels young, forward-thinking, and growth-oriented, while remaining highly legible at small sizes.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "We want logo design like think bold and unique font it aiming grow up that colour is indicated young and forward thinking"
        ]
      },
      "acceptanceCriteria": [
        "New logo design direction is clearly typographic (font-led) and reads as bold/unique",
        "Color treatment communicates a youthful and forward-thinking brand impression",
        "Logo remains readable at header size (approx. 36–40px tall) and icon size (256x256)"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the frontend to use the new logo assets everywhere the brand logo appears by updating frontend/src/lib/brandAssets.ts and any remaining hardcoded logo references (e.g., social meta tags in frontend/index.html) to point to the new generated filenames.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "We want logo design like think bold and unique font it aiming grow up that colour is indicated young and forward thinking"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/lib/brandAssets.ts points to the new horizontal, icon, and social logo asset paths under /assets/generated/",
        "The header and footer logo render the new horizontal logo via BRAND_ASSETS.logoHorizontal",
        "OpenGraph/Twitter social image in frontend/index.html uses the new social logo asset filename (not the old one)",
        "SEO structured data continues to use BRAND_ASSETS.logoSocial (no regression)"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the newly generated logo image files are included as static assets under frontend/public/assets/generated and that the app builds and renders without broken image links.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "We want logo design like think bold and unique font it aiming grow up that colour is indicated young and forward thinking"
        ]
      },
      "acceptanceCriteria": [
        "All new logo files exist in frontend/public/assets/generated with the expected filenames",
        "No missing-image placeholders or 404s occur for logo assets in header, footer, or social meta image"
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only components).",
    "Do not edit immutable hook files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Keep backend as a single Motoko actor; no backend changes are required for this logo update."
  ],
  "nonGoals": [
    "Do not redesign the full site layout or section content beyond updating logo asset references.",
    "Do not change authentication or contact form/backend message storage behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": [
      "Update to a bold, unique, youthful, forward-thinking typographic logo style with a growth-oriented color treatment (premium-logo-horizontal-lightblue.dim_512x128.png > bold-youthful-logo-horizontal.dim_512x128.png)",
      "Update to a matching bold, unique icon-style logo mark suitable for small sizes (premium-logo-icon-lightblue.dim_256x256.png > bold-youthful-logo-icon.dim_256x256.png)",
      "Update to a matching bold, unique wide logo lockup suitable for social sharing previews (ocean-empowerer-solutions-logo-lightblue.dim_512x256.png > bold-youthful-logo-social.dim_512x256.png)"
    ]
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}