{
  "kind": "build_request",
  "title": "Professional theme upgrade (more polished visual design)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Apply a cohesive, professional visual theme across the site (colors, typography, spacing, shadows, borders) while keeping all existing sections and content structure intact. The theme should feel modern and corporate, with restrained use of accent colors and improved contrast/readability.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "we want professional Version Theme updarde"
        ]
      },
      "acceptanceCriteria": [
        "The overall look and feel is consistently professional across header, all sections, and footer (no section appears to use a different style system).",
        "Typography is consistent (heading hierarchy, body sizes, line-heights) and readability is improved compared to current theme.",
        "Color usage is restrained and consistent (primary/secondary/accent are used intentionally; muted/foreground contrast meets accessibility expectations).",
        "No content sections are removed or hidden as part of the theme upgrade."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update global theme tokens and base styles to match the new professional theme by refining CSS variables and shared utility classes (e.g., in the global stylesheet and Tailwind theme), without changing the app’s routing or adding new features.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "we want professional Version Theme updarde"
        ]
      },
      "acceptanceCriteria": [
        "Global design tokens (background/foreground, primary/secondary/accent, border/ring, radii, shadows) are updated to reflect the new theme.",
        "Common shared classes (e.g., navigation link styling, section spacing, section headings) reflect the new theme and reduce one-off styling drift.",
        "The site renders correctly in both light and dark mode if dark mode is currently supported by tokens (no unreadable text on either mode)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Polish key UI components for a more premium, professional presentation: header/navigation, primary/secondary/outline buttons, cards used in Services/Projects/Why Choose Us/About/Leadership, and Contact information panels; ensure consistent hover/focus states and visual rhythm.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "we want professional Version Theme updarde"
        ]
      },
      "acceptanceCriteria": [
        "Header and navigation look more polished (spacing, alignment, hover/active states) and remain fully functional on desktop and mobile.",
        "Buttons have consistent sizing, typography, hover, and focus styles across the app.",
        "Cards and panels have consistent borders/radii/shadows and consistent internal spacing across all sections.",
        "No regressions in responsiveness: layout remains clean on mobile, tablet, and desktop breakpoints."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (shadcn UI sources); compose and style via props/classes instead.",
    "Do not edit immutable frontend hook files listed in SYSTEM_CONTEXT (e.g., useInternetIdentity/useActor/main.tsx).",
    "Backend (Motoko) behavior and data structures must remain unchanged; this request is theme-only unless theme changes require no data migration."
  ],
  "nonGoals": [
    "Adding new sections or new business features beyond visual/theme changes.",
    "Changing company copy/content strategy (other than minor typographic presentation improvements).",
    "Implementing new authentication methods or third-party integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}