{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Empowerment-focused ocean logo refresh and site-wide asset swap",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Add updated ocean-themed empowerment logo assets (horizontal, icon, and social image) as static generated assets.",
      "acceptanceCriteria": [
        "Updated logo visuals clearly incorporate an ocean identity (e.g., wave/sea forms) plus an unmistakable upward/leadership cue (e.g., rising crest, arrow, peak, lighthouse, etc.) without becoming overly complex.",
        "Logo remains premium/clean and readable at small sizes (header height ~32–40px).",
        "Color/contrast remains suitable on the site header/footer backgrounds (no loss of legibility)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/premium-logo-horizontal-empowerment.dim_512x128.png",
          "operation": "create",
          "description": "Add the newly generated empowerment-focused horizontal ocean brand logo asset (edited from the current premium horizontal logo) as a static file."
        },
        {
          "path": "frontend/public/assets/generated/premium-logo-icon-empowerment.dim_256x256.png",
          "operation": "create",
          "description": "Add the newly generated empowerment-focused square icon variant as a static file, ensuring strong legibility at small sizes."
        },
        {
          "path": "frontend/public/assets/generated/ocean-empowerer-solutions-logo-empowerment.dim_512x256.png",
          "operation": "create",
          "description": "Add the newly generated wide social logo image (ocean identity + empowerment/leadership cue) as a static file for OG/Twitter sharing previews."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Swap header and footer logo image src to the newly generated empowerment horizontal logo asset, ensuring consistent lockup.",
      "acceptanceCriteria": [
        "Header logo renders correctly and does not overflow the existing max-width constraints.",
        "Footer logo renders correctly and matches the header logo (same asset/lockup).",
        "No broken image links in header/footer on hard refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/brandAssets.ts",
          "operation": "create",
          "description": "Create a single source of truth for brand asset static paths (e.g., header/footer logo and social image) to keep usage consistent and avoid accidental backend fetching."
        },
        {
          "path": "frontend/src/components/SiteHeader.tsx",
          "operation": "modify",
          "description": "Update the header logo image src to use the new static empowerment horizontal logo asset (via the shared brand assets module). Preserve existing sizing/max-width behavior."
        },
        {
          "path": "frontend/src/components/SiteFooter.tsx",
          "operation": "modify",
          "description": "Update the footer logo image src to use the same new static empowerment horizontal logo asset as the header (via the shared brand assets module)."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Update SEO/metadata to reference the new generated logo/social image assets (structured data + OG/Twitter).",
      "acceptanceCriteria": [
        "frontend/src/components/SeoStructuredData.tsx uses the new logo image filename for the Organization \"logo\" field.",
        "frontend/index.html og:image and twitter:image reference the new generated social logo image filename.",
        "After build, the referenced assets exist under frontend/public/assets/generated and load successfully in the browser."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SeoStructuredData.tsx",
          "operation": "modify",
          "description": "Update Organization structured data logo reference to the new empowerment logo image filename (preferably via the shared brand assets module)."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update og:image and twitter:image to reference the new generated social logo image at frontend/public/assets/generated/ocean-empowerer-solutions-logo-empowerment.dim_512x256.png."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Ensure new logo assets live under frontend/public/assets/generated and are referenced directly as static assets only.",
      "acceptanceCriteria": [
        "All new/updated logo images are present under frontend/public/assets/generated.",
        "No frontend code attempts to fetch logo images from the backend canister."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/.gitkeep",
          "operation": "create",
          "description": "Ensure the generated assets directory is tracked even in clean checkouts/build environments (if not already), keeping all logo assets served as static files only."
        },
        {
          "path": "frontend/src/lib/brandAssets.ts",
          "operation": "modify",
          "description": "Ensure all exported brand asset paths are direct static paths under /assets/generated (no backend/canister fetching), covering the horizontal logo, icon, and social image filenames."
        }
      ]
    }
  ]
}