{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Elaborate single-page theme with right-aligned link-style navigation and scroll-aware active states",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Right-align the desktop header navigation to the top-right of the header and increase its visual size without overlap.",
      "acceptanceCriteria": [
        "On desktop widths (md and up), the navigation links render aligned to the right side of the header area.",
        "Navigation link text is visibly larger than the current `text-sm` styling (e.g., `text-base` or equivalent), while remaining responsive and not wrapping unexpectedly.",
        "No layout overlap occurs between the logo/company name and the navigation items at common viewport widths."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SiteHeader.tsx",
          "operation": "modify",
          "description": "Adjust the header layout so the desktop nav sits to the right of the logo and is right-aligned (e.g., use flex growth/`ml-auto` patterns) and increase link typography from the current `text-sm` to a larger responsive size; ensure no overlap with logo/company name at md+ widths."
        },
        {
          "path": "frontend/index.css",
          "operation": "modify",
          "description": "Add cohesive nav typography/spacing utility styles (e.g., a shared nav-link class for md+ sizing/letter-spacing) to support the larger desktop menu while keeping responsive behavior consistent across the site."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Convert desktop navigation to link-style presentation with hover and scroll-synced active state while preserving smooth scroll.",
      "acceptanceCriteria": [
        "Desktop nav items are styled as links (e.g., underline/indicator on hover and active) rather than button-like UI.",
        "As the user scrolls through the single-page sections (`home`, `about`, `services`, `contact`), the corresponding nav item reflects an active state.",
        "Clicking a nav link still smooth-scrolls to the correct section (existing behavior preserved)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActiveSection.ts",
          "operation": "create",
          "description": "Create a hook that tracks the currently active section among `home`, `about`, `services`, and `contact` based on scroll position (e.g., via IntersectionObserver) and returns the active section id for nav highlighting."
        },
        {
          "path": "frontend/src/components/SiteHeader.tsx",
          "operation": "modify",
          "description": "Replace button-like desktop nav items with true link-style elements (anchor semantics) that still smooth-scroll on click; use the active section from `useActiveSection` to render active/selected state (e.g., underline/indicator and `aria-current`)."
        },
        {
          "path": "frontend/src/components/MobileNav.tsx",
          "operation": "modify",
          "description": "Align mobile menu items with the same link-mode styling direction (less button-like) and optionally reflect the active section for consistency with desktop behavior."
        },
        {
          "path": "frontend/index.css",
          "operation": "modify",
          "description": "Implement consistent link-mode nav styles (hover + active indicator/underline) using the existing Tailwind/CSS-variable approach; avoid one-off per-section styles."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Increase visual richness across Home/About/Services/Contact while keeping the same single-page structure and section IDs.",
      "acceptanceCriteria": [
        "The Home, About, Services, and Contact sections remain present and reachable via the header navigation.",
        "Each section shows a noticeable increase in visual richness (improved spacing, typography hierarchy, and/or decorative layout elements) without adding new top-level pages.",
        "Mobile responsiveness is maintained (no horizontal overflow; content remains readable and properly spaced on small screens)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.css",
          "operation": "modify",
          "description": "Introduce reusable section/layout utility classes (e.g., section spacing, subtle separators, background treatments, typography rhythm) to make the page feel more elaborate without adding new routes or breaking responsiveness."
        },
        {
          "path": "frontend/src/components/sections/HomeSection.tsx",
          "operation": "modify",
          "description": "Enhance hero composition and hierarchy (e.g., improved spacing rhythm, refined badge/heading/subtitle alignment, and decorative separator treatment) while keeping the `home` section id and existing smooth-scroll CTA behavior. Uses existing shadcn-ui Button component for CTAs; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/sections/AboutSection.tsx",
          "operation": "modify",
          "description": "Polish About section presentation (typography hierarchy, spacing, and card-like treatments for stats/partners) while keeping the `about` id and current content source unchanged."
        },
        {
          "path": "frontend/src/components/sections/ServicesSection.tsx",
          "operation": "modify",
          "description": "Elevate Services section with improved grid rhythm and more polished Card presentation while keeping the `services` id and content mapping intact. Uses existing shadcn-ui Card components; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/sections/ContactSection.tsx",
          "operation": "modify",
          "description": "Refine Contact section layout density and visual hierarchy (info block + form balance, improved spacing, subtle background/separator) while keeping the `contact` id and current contact form behavior intact."
        },
        {
          "path": "frontend/src/components/ContactForm.tsx",
          "operation": "modify",
          "description": "Polish the form container/fields presentation for a more elaborate feel (spacing, headings/labels rhythm, success state styling) without adding third-party services or new pages. Uses existing shadcn-ui form primitives (Button/Input/Textarea/Label); verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Apply a cohesive visual theme (colors, typography, accents) consistently across header, sections, and footer.",
      "acceptanceCriteria": [
        "Header, section blocks, and footer share consistent styling decisions (typography scale, spacing, and accent usage).",
        "Theme is implemented using existing Tailwind/CSS variable approach and does not introduce inconsistent one-off styles across sections."
      ],
      "file_operations": [
        {
          "path": "frontend/index.css",
          "operation": "modify",
          "description": "Strengthen the site-wide theme using the existing CSS variable + Tailwind approach (e.g., consistent accent usage, section background tokens, and typography rhythm utilities) and ensure styles are applied consistently (not as isolated one-offs)."
        },
        {
          "path": "frontend/src/components/SiteHeader.tsx",
          "operation": "modify",
          "description": "Align header styling with the updated cohesive theme (consistent background, border, nav link indicators, and spacing) while maintaining sticky behavior and responsiveness."
        },
        {
          "path": "frontend/src/components/SiteFooter.tsx",
          "operation": "modify",
          "description": "Update footer styling to match the same theme accents and typography scale as the header/sections, keeping its structure and smooth-scroll quick links intact."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "If needed to support the cohesive theme, extend Tailwind tokens (e.g., additional shadows/animations/typography scale) in a centralized way consistent with existing configuration, avoiding scattered one-off inline styles."
        }
      ]
    }
  ]
}